{
    "about": "Welcome to Steni Electricals and Estore, where power meets precision! We take pride in being your one-stop destination for top-notch battery solutions, expert electrical services, and cutting-edge solar products.\n\n\n  Why Choose Steni Electricals? \n A Legacy of Excellence\n With a rich history in the energy industry, Steni Electricals has been a trusted name since 2010. Over the years, our commitment to excellence has earned us the trust of over 1000 happy customers and counting.\n\n Comprehensive Battery Solutions\n Whether you need reliable batteries for your home, business, or industrial needs, we've got you covered. Our extensive range ensures you find the perfect power solution tailored to your requirements.\n\n Expert Electrical Work\n Leave your electrical needs in the hands of our skilled technicians. From installations to repairs, our team is dedicated to ensuring your electrical systems run smoothly and efficiently.\n\nSolar Innovations\n Embrace the future of energy with our cutting-edge solar products, including solar water heaters and hassle-free solar electric bike installations. We are committed to sustainable energy solutions that not only benefit you but also contribute to a greener planet.\n\n Customer-Centric Approach\n At Steni Electricals and Estore, your satisfaction is our priority. Our team is driven by a passion for providing the best customer service and support. We go above and beyond to ensure your experience with us is seamless and enjoyable.\n\n Industry-Leading Professionals\n Our team of experts comprises industry-leading professionals with a wealth of experience. Rest assured, your energy needs are in capable hands.\n\n\n\n Join the ranks of our satisfied customers who have experienced the Steni Electricals and Estore difference. Discover why we are the preferred choice for battery sales, electrical services, and solar products. Choose power, choose precision – choose Steni Electricals and Estore.\n\n\n Feel the energy. Experience the excellence. Connect with us today!\n\n\n\n\n Feel free to customize the content based on the specific details of your business and the messaging tone you prefer.",


    "imageSource": "images/logo.png"
    
    
}